<?php 
$gift = 40;//红包总额
$mon = array(0,0,0,0,0,0,0,0,0,0);//初始数组
while($gift>0){//循环，直到红包为0
  $add = rand(0,9);//10抽1
  if($mon[$add]<6){//当前还小于6则执行红包扩充
    $mon[$add]+=1;//个人红包加一
    $gift-=1;//红包总量减一
  }
}
var_dump($mon);
echo "<br>";

$gift = 40;
for($i=0;$i<10;$i++){//发十个红包循环
  if($gift>6){//当前红包可取的最大值。只要剩余红包大于6，最大值就为6，否则最大值为红包余量
    $max = 6;
  }else{
    $max = $gift;
  }
  if(6*(9-$i)>=$gift){//当前红包可取最小值。
    $min = 0;         //包括当前红包所有之前的去掉，剩下的数量全按6算，
                      //大于红包余量则最小值可以为0，否则为红包余量减去后面全为6的总值
  }else{
    $min = $gift-6*(9-$i);
  }
  $mo[$i] = rand($min,$max);//发红包，在可取最大最小的区间内随机
  $gift = $gift-$mo[$i];//红包总量减少
}
var_dump($mo);
echo "<br>",array_sum($mo);
